#include <iostream>



int main()
{

////////////////////////////////////////////////////////////////////////////////////////////////////////
//1. Написать программу, вычисляющую выражение a* (b + (c / d)) и выводящую результат с плавающей точкой,
//где a, b, c, d– целочисленные константы															  
////////////////////////////////////////////////////////////////////////////////////////////////////////
 /*
   const int a = 19;
   const int b = 23;
   const int c = 5;
   const int d = 8;
  
   float e = a*(b + (float(c) / d));

   std::cout << e << std::endl;
*/
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//2. Дано целое число. Если оно меньше или равно 21, то выведите на экран разницу между этим числом и числом 21.																							  //
// Если же заданное число больше, чем 21, необходимо вывести удвоенную разницу между этим числом и 21.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////


   int r = 22;
   int t = (r <= 21) ? r - 21 : 2 * (r - 21);

   std::cout << t << std::endl;


/////////////////////////////////////////////////////////////////////////////////////////////////////////
//3.Описать трёхмерный целочисленный массив, размером 3х3х3 и указатель на значения внутри массива и при 
//помощи операции разыменования вывести на экран значение центральной ячейки получившегося куба[1][1][1].
/////////////////////////////////////////////////////////////////////////////////////////////////////////

   int array[3][3][3] = { {{1,2,3},{4,5,6},{7,8,9}},{{10,11,12},{13,14,15},{16,17,18}},{{19,20,21},{22,23,24},{25,26,27}} };
   int *ptr = nullptr;
   ptr = &array[1][1][1];
   
   std::cout << *ptr << std::endl;

///////////////////////////////////////////////////////////////////////////////////////////////////////////
//4. ** Написать программу, вычисляющую выражение из   первого задания, а переменные для неё объявлены и
//инициализировать в другом cpp файле.Используйте extern.
//////////////////////////////////////////////////////////////////////////////////////////////////////////

	extern const int a;
	extern const int b;
	extern const int c;
	extern const int d;

    float e = a * (b + (float(c) / d));

    std::cout << e << std::endl;

	return 0;
}

